export default class ClassRace{
    public static RaceVenue: {
        [no: number]: string
    } = {
        1 : '札幌',
        2 : '函館',
        3 : '福島',
        4 : '新潟',
        5 : '東京',
        6 : '中山',
        7 : '中京',
        8 : '京都',
        9 : '阪神',
        10 : '小倉',
    }
    
    public static VaneuMatch: {
        [no: number]: RegExp
    } = {
        1:  /札幌/,
        2:  /函館/,
        3:  /福島/,
        4:  /新潟/,
        5:  /東京/,
        6:  /中山/,
        7:  /中京/,
        8:  /京都/,
        9:  /阪神/,
        10: /小倉/,
    }

    public static VenueCode: {
        [no: number]: string
    } = {
        1 : '01',
        2 : '02',
        3 : '03',
        4 : '04',
        5 : '05',
        6 : '06',
        7 : '07',
        8 : '08',
        9 : '09',
        10 : '10'
    }
}
export const RaceVenue = {
    札幌 : '01',
    函館 : '02',
    福島 : '03',
    新潟 : '04',
    東京 : '05',
    中山 : '06',
    中京 : '07',
    京都 : '08',
    阪神 : '09',
    小倉 : '10'
}

export const MatchVenue = {
    1:  /札幌/,
    2:  /函館/,
    3:  /福島/,
    4:  /新潟/,
    5:  /東京/,
    6:  /中山/,
    7:  /中京/,
    8:  /京都/,
    9:  /阪神/,
    10: /小倉/,
}

export const Venue = {
    1:  '01',
    2:  '02',
    3:  '03',
    4:  '04',
    5:  '05',
    6:  '06',
    7:  '07',
    8:  '08',
    9:  '09',
    10: '10'
}